Repository: aselak30/child_app
Catalog: lib/l10n/app_*.arb
Languages: si, ta

source: Search here
si: සොයන්න
ta: இங்கே தேடவும்

source: See more
si: තව බලන්න
ta: மேலும் பார்க்க

source: Change Language
si: භාෂාව වෙනස් කරන්න
ta: மொழியை மாற்றவும்

# enter_email
source: Enter your email
si: ඔබගේ විද්යුත් තැපෑල ඇතුලත් කරන්න

# enter_registered_email
source: Please enter your registered Email
si: කරුණාකර ඔබගේ ලියාපදිංචි විද්යුත් තැපෑල ඇතුලත් කරන්න
ta: உங்கள் பதிவு செய்யப்பட்ட மின்னஞ்சலை உள்ளிடவும்

source: Email Address
si: විද්යුත් තැපෑල
ta: மின்னஞ்சல் முகவரி

source: Submit
si: ඉදිරිපත් කරන්න
ta: சமர்ப்பிக்கவும்

source: Successful
si: සාර්ථකයි
ta: வெற்றியடைந்தது

# successful_register
source: You have successfully registered to the system. Please login to the system to explore
si: ඔබ සාර්ථකව පද්ධතියට ලියාපදිංචි වී ඇත. කරුණාකර ගවේෂණය කිරීමට පද්ධතියට ඇතුලත් වන්න
ta: கணினியில் வெற்றிகரமாக பதிவு செய்துள்ளீர்கள். ஆராய கணினியில் உள்நுழையவும்

source: Log In
si: ඇතුල් වන්න
ta: உள்நுழைக

source: LOGIN
si: ඇතුල් වන්න
ta: உள்நுழைக

source: Register
si: ලියාපදිංචි කරන්න
ta: பதிவு செய்யுங்கள்

source: Create New Account
si: නව ගිණුමක් සාදන්න
ta: புதிய கணக்கை உருவாக்கவும்

source: Full name
si: සම්පූර්ණ නම
ta: முழுப் பெயர்

# splash_one
source: The best place for children to get
si: දරුවන්ට උපදෙස් සහ විසඳුම් ලබා ගැනීමට
ta: குழந்தைகள் ஆலோசனை மற்றும் தீர்வுகளைப்

# splash_two
source: advice and solutions
si: හොඳම ස්ථානය

# login_to_continue
source: Log in to continue your account
si: ඔබගේ ගිණුම දිගටම කරගෙන යාමට ලොග් වන්න
ta: உங்கள் கணக்கைத் தொடர உள்நுழையவும்

source: Password
si: මුරපදය
ta: கடவுச்சொல்

# forget_password
source: Forgot Password
si: මුරපදය අමතක වුණා ද

source: First Name
si: මුල් නම
ta: முதல் பெயர்

source: Last Name
si: අවසන් නම
ta: கடைசி பெயர்

source: User Name
si: පරිශීලක නාමය
ta: பயனர் பெயர்

source: Create Password
si: මුරපදය සාදන්න
ta: கடவுச்சொல்லை உருவாக்கவும்

# please_create_password
source: Please create a new password for your account
si: කරුණාකර ඔබගේ ගිණුම සඳහා නව මුරපදයක් සාදන්න
ta: உங்கள் கணக்கிற்கு புதிய கடவுச்சொல்லை உருவாக்கவும்

source: Confirm Password
si: මුරපදය තහවුරු කරන්න
ta: கடவுச்சொல்லை உறுதிப்படுத்தவும்

source: Password must be
si: මුරපදය විය යුතුය
ta: Pகடவுச்சொல் இருக்க வேண்டும்

# eight_characters
source: 8 characters long
si: අක්ෂර 8 ක් දිග
ta: 8 எழுத்துக்கள் நீளம்

source: One uppercase letter
si: 1 ලොකු අකුරු
ta: 1 பெரிய எழுத்து

# one_special_character
source: 1 special character
si: 1 විශේෂ අකුරු
ta: 1 சிறப்பு எழுத்து

# one_number
source: 1 number
si: 1 අංකය
ta: 1 எண்

source: No spaces
si: හිස්තැන් නැත
ta: இடைவெளிகள் இல்லை

source: Edit profile
si: පැතිකඩ සංස්කරණය කරන්න
ta: சுயவிவரத்தை திருத்தவும்

source: Chat now
si: දැන් කතාබස් කරන්න
ta: இப்போது பேசு

source: Language
si: භාෂාව
ta: மொழி

source: Settings
si: සැකසීම්
ta: அமைப்புகள்

source: Help & support
si: උදව් සහ සහාය
ta: உதவி மற்றும் ஆதரவு

source: Log out
si: ලොග් අවුට් වෙන්න
ta: வெளியேறுதல்

source: NEXT
si: ඊළඟ
ta: அடுத்தது

# password_not_match
source: Password do not match
si: මුරපදය නොගැලපේ
ta: கடவுச்சொல் பொருந்தவில்லை

# password_seq
source: The password you have entered does not meet the minimum security requirements
si: ඔබ ඇතුළත් කළ මුරපදය අවම ආරක්ෂක අවශ්‍යතා සපුරාලන්නේ නැත
ta: நீங்கள் உள்ளிட்ட கடவுச்சொல் குறைந்தபட்ச பாதுகாப்பு தேவைகளை பூர்த்தி செய்யவில்லை

source: Home
si: නිවස
ta: வீடு

source: FAQs
si: ප්‍රශ්න සහ පිලිතුරු
ta: கேள்விகள் மற்றும் பதில்கள்

# faq_school_q
source: How long should I study in school?
si: මම කී වයසේදී පාසලට යා යුතුද?
ta: நான் எவ்வளவு காலம் பள்ளியில் பயில வேண்டும்?

# faq_school_a
source: In Sri Lanka, the mandatory age for education is between 5 and 16 years. Parents are legally required to ensure that their children attend school during this period. But it’s always better to finish school at the correct age (after A/Ls).
si: ශ්‍රී ලංකාවේ අනිවාර්ය අධ්‍යාපන වයස අවුරුදු 5 සිට 16 දක්වා වේ. මව්පියන්ට තම දරුවන්ට පාසලට යාම සහතික කිරීම නීතිමය වශයෙන් අනිවාර්ය වේ. ඒත් විභාග (ඒ/ලෙවල්) අවසන් කරලා ඉවර වීම වඩා හොඳයි.
ta: இலங்கையில் கட்டாய கல்வி வயது 5 முதல் 16 வரை. பெற்றோர்கள் குழந்தைகள் பள்ளிக்கு செல்லுவதை உறுதி செய்ய வேண்டும். ஆனால் சாதாரணமாக உயர்தரத்திற்கு (A/Ls) பிறகே பள்ளியை முடிக்கலாம்.

# faq_report_violation_q
source: How can I report a violation?
si: අධිකාරියකට පැමිණිලි කිරීම කෙසේද?
ta: ஊடாடல்களில் நடந்த மீறலை எங்கே புகார் அளிக்கலாம்?

# faq_report_violation_a
source: Re-direct to the – Reporting numbers + departments/ Orgs
si: එය අදාළ අංශ/අධ්‍යක්ෂාධිකාරීන් වෙත වාර්තා කළ යුතුය – වාර්තාකරණ අංක භාවිතා කරන්න.
ta: தகுந்த எண்ணுகள் அல்லது அரசு துறைகளுக்கு தகவல் கொடுங்கள்.

# faq_vote_q
source: Can I vote/ Do I have a right to vote?
si: මට ඡන්දය දිය හැකිද?
ta: நான் வாக்களிக்க முடியுமா?

# faq_vote_a
source: No, to vote you have to be above 18 years old.
si: නැහැ, ඡන්දය දීමට ඔබ වයස අවුරුදු 18 ට වඩා වැඩි විය යුතුය.
ta: இல்லை, வாக்களிக்க நீங்கள் 18 வயதுக்கு மேல் இருக்க வேண்டும்.

# faq_safe_online_q
source: Do I have a right to be safe online?
si: මට අන්තර්ජාලයේ ආරක්ෂිතව සිටින්න පුළුවන්ද?
ta: நான் ஆன்லைனில் பாதுகாப்பாக இருக்க உரிமை உள்ளதா?

# faq_safe_online_a
source: Yes, children in Sri Lanka have the right to be safe online.
si: ඔව්, ශ්‍රී ලංකාවේ දරුවන්ට අන්තර්ජාලයේ ආරක්ෂාව ලබාගැනීමට හිමිකම් ඇත.
ta: ஆம், இலங்கையில் உள்ள குழந்தைகள் ஆன்லைனில் பாதுகாப்பாக இருக்க உரிமையுடையவர்கள்.

# faq_drive_q
source: Can I drive/ How old should I be able to drive?
si: මට රිය පැදිය හැක්කේ කවදාද?
ta: நான் எப்போது வாகனம் ஓட்டலாம்?

# faq_drive_a
source: To be able to drive you should be 18 years or above.
si: ඔබට වයස අවුරුදු 18 ක් වීමෙන් පසුව රිය පැදිය හැක.
ta: நீங்கள் 18 வயதிற்கு மேல் ஆகும்போது வாகனம் ஓட்டலாம்.

# faq_rights_age_q
source: How old should I be to get these/my rights?
si: මට මෙම හිමිකම් ලබාගත හැක්කේ කවදාද?
ta: இந்த உரிமைகள் எனக்கு எப்போது கிடைக்கும்?

# faq_rights_age_a
source: It is your Birth right.
si: ඒ ඔබගේ උපන්හිමිකමකි.
ta: இவை உங்கள் பிறப்புரிமைகள்.

# faq_sue_q
source: Can a child sue a person or an organisation in courts?
si: දරුවෙකුට පුද්ගලයෙකු හෝ ආයතනයක් විරුද්ධව නඩු පැවරිය හැකිද?
ta: ஒரு குழந்தை ஒருவரை அல்லது நிறுவனத்தை வழக்குப்பதிய முடியுமா?

# faq_sue_a
source: Yes, under Sri Lankan law, children have certain legal rights and protections.
si: ඔව්, ශ්‍රී ලංකාවේ නීතියට අනුව දරුවන්ට නීතිමය ආරක්ෂාවන් සහ හිමිකම් ඇත.
ta: ஆம், இலங்கை சட்டத்தின் கீழ், குழந்தைகளுக்கு சில சட்ட உரிமைகள் மற்றும் பாதுகாப்புகள் உள்ளன.

# faq_convict_q
source: Can a child be convicted of a crime?
si: දරුවෙකුට අපරාධයකට දඬුවම් කළ හැකිද?
ta: ஒரு குழந்தையை குற்றத்தில் தண்டிக்க முடியுமா?

# faq_convict_a
source: The Children and Young Persons Ordinance in Sri Lanka provides guidelines for dealing with children who are involved in criminal activities.
si: ශ්‍රී ලංකාවේ දරුවන්ට අදාල නීති පිළිබඳව Children and Young Persons Ordinance හි විශේෂ ව්‍යවස්ථා තිබේ.
ta: Children and Young Persons Ordinance என்ற சட்டம் கீழ் குழந்தைகள் குற்றங்களில் ஈடுபட்டால் என்ன செய்ய வேண்டும் என வழிகாட்டுகிறது.

# faq_work_q
source: Can a child engage in economic activities?
si: දරුවෙකුට ආර්ථික කටයුතු කළ හැකිද?
ta: ஒரு குழந்தை பணியில் ஈடுபட முடியுமா?

# faq_work_a
source: Yes, above 16. but any child could help their parents in their respective economic activities/engagements (Agri)
si: ඔව්, වයස අවුරුදු 16 ට වැඩි නම්. නමුත් සිය පවුලේ වෘත්තිය කටයුතු සඳහා උපකාර කිරීමේ හැකියාව සෑම දරුවෙකුටම ඇත.
ta: ஆம், 16 வயதுக்கு மேல் இருந்தால். ஆனால் குழந்தைகள் பெற்றோருக்கு உதவியாக வேலை செய்யலாம் (விவசாயம் போன்றவை).

# faq_who_is_child_q
source: Who is a child?
si: දරුවෙකු කියන්නේ කවුද?
ta: ஒரு குழந்தை யார்?

# faq_who_is_child_a
source: Any person under the age of 18 is seen as a child.
si: වයස අවුරුදු 18 ට අඩු පරිස්සමක් ඇති ඕනෑම පුද්ගලයෙකු දරුවෙකු ලෙස සලකයි.
ta: 18 வயதுக்குக் குறைவானவர் ஒரு குழந்தையாகக் கருதப்படுகிறார்.

# faq_parents_rights_q
source: Does my mother/father have these rights?
si: මගේ අම්මා/තාත්තාටත් මේ හිමිකම් තියෙනවද?
ta: என் அம்மா/அப்பாவுக்கு இந்த உரிமைகள் உள்ளதா?

# faq_parents_rights_a
source: Yes, It’s called human rights.
si: ඔව්, ඒවා මිනිස් හිමිකම් ලෙස හැඳින්වේ.
ta: ஆம், அவை மனித உரிமைகள்.

# faq_rights_not_respected_q
source: What happens if my rights are not respected?
si: මගේ හිමිකම් නොගරු කරනවා නම් මට කරන්නෙ මොකද්ද?
ta: என் உரிமைகள் மதிக்கப்படவில்லை என்றால் என்ன ஆகும்?

# faq_rights_not_respected_a
source: If you feel like your rights are not being respected, it’s important to tell a trusted grown-up.
si: ඔබගේ හිමිකම් නොගරු කරන බවක් ඔබට හැඟේ නම්, විශ්වාස කළ හැකි වැඩිහිටියෙකුට කියන්න.
ta: உங்கள் உரிமைகள் மீறப்படுகின்றன என்று நினைத்தால், நீங்கள் நம்பும் ஒரு பெரியவரிடம் சொல்லுங்கள்.

# faq_family_move_q
source: What happens if my family moves to a different country?
si: මගේ පවුල වෙනත් රටකට යනවා නම් මට මොකද වෙන්නේ?
ta: என் குடும்பம் வேறு நாட்டுக்கு செல்லும் போது என்ன நடக்கும்?

# faq_family_move_a
source: Even if you move to a different country, you still have the same rights.
si: ඔබ වෙනත් රටකට ගියද, ඔබගේ හිමිකම් ඒ රටටත් එක්ක යනවා. ඒවා ඔබගේ ආරක්ෂාවට සහාය වන්නේය.
ta: நீங்கள் வேறு நாட்டுக்கு சென்றாலும், உங்கள் உரிமைகள் அதேபோலவே தொடரும்.

# faq_rights_violated_by_known_q
source: What if my rights are violated by someone I know?
si: මට හඳුනාගෙන ඉන්න කෙනෙක් මගේ හිමිකම් උල්ලංඝනය කළොත් මොකද වෙන්නේ?
ta: நான் தெரிந்த ஒருவரால் என் உரிமைகள் மீறப்படின் என்ன செய்வது?

# faq_rights_violated_by_known_a
source: You can also report it by calling 1929, which is the Childline of the National Child Protection Authority.
si: ඔබ විශ්වාස කළ හැකි වැඩිහිටියෙකුට මේ පිළිබඳව වහාම කියන්න. හෝ 1929 දුරකථන අංකය (National Child Protection Authority) අමතන්න.
ta: நம்பக்கூடிய பெரியவரிடம் சொல். 1929 எனும் இலங்கை தேசிய குழந்தை பாதுகாப்பு அதிகார சுயவிநம்பிக்கையுடன் தொடர்பு கொள்ளவும்.

# faq_boys_girls_rights_q
source: Are there different rights for boys and girls?
si: පිරිමි ළමයින්ට සහ ගැහැණු ළමයින්ට වෙනම හිමිකම් තියෙනවද?
ta: ஆண் மற்றும் பெண் குழந்தைகளுக்கு வேறுபட்ட உரிமைகள் உள்ளதா?

# faq_boys_girls_rights_a
source: No, boys and girls have the same rights.
si: නැහැ, පිරිමි සහ ගැහැණු දරුවන්ට සමාන හිමිකම් ඇත.
ta: இல்லை, எல்லா குழந்தைகளுக்கும் சம உரிமைகள் உள்ளன.

# faq_lose_rights_q
source: Can I lose my rights?
si: මට මගේ හිමිකම් නැතිවෙන්න පුළුවන්ද?
ta: நான் என் உரிமைகளை இழக்கலாமா?

# faq_lose_rights_a
source: No, you can’t lose your rights. Your rights are yours from the moment you’re born.
si: නැහැ, ඔබ උපන් මොහොතේ සිටම ඔබට හිමිකම් ඇත. ඒවා ඔබගේ වටිනා තෑග්ගක් වගේය.
ta: இல்லை, உங்கள் உரிமைகள் பிறந்த தருணத்திலிருந்தே உங்களுக்கே உரியது.

# faq_promote_rights_q
source: How can I help promote child rights?
si: මට ළමා හිමිකම් ප්‍රවර්ධනය කිරීමට මොනවද කළ හැක්කේ?
ta: நான் குழந்தை உரிமைகளை எவ்வாறு பிரபலமாக்கலாம்?

# faq_promote_rights_a
source: You can help promote child rights by learning about your rights and sharing that knowledge with others.
si: ඔබට මඟහැරෙන්නෙ නැතිව ඔබේ හිමිකම් පිළිබඳව ඉගෙනගෙන එය වෙනත් දරුවන්ට කියාදීමයි.
ta: உங்கள் உரிமைகள் பற்றி அறிந்து கொண்டு, மற்றவர்களுக்கும் பகிர்ந்து கூறுங்கள்.

# faq_see_rights_ignored_q
source: What can I do if I see my friend’s or my rights being ignored?
si: මගේ හෝ මගේ මිතුරන්ගේ හිමිකම් නොසලකා හැරෙනවා දැකිය හැකිද?
ta: நான் என் நண்பரின் உரிமைகள் மீறப்படுவதை பார்த்தால் என்ன செய்யலாம்?

# faq_see_rights_ignored_a
source: You can speak up and tell a grown-up you trust, like a teacher or a parent.
si: ඔබට විශ්වාස කළ හැකි වැඩිහිටියෙකුට, උදාහරණයක් ලෙස ගුරුවරයෙකුට හෝ දෙමව්පියෙකුට මෙය වාර්තා කළ හැක.
ta: நீங்கள் நம்பும் பெரியவரிடம் (ஆசிரியர் அல்லது பெற்றோர்) சொல்லுங்கள்.

# faq_who_made_rules_q
source: Who made the rules for child rights?
si: ළමා හිමිකම් පිළිබඳ නීති තීරණය කළේ කවුද?
ta: குழந்தை உரிமைகளுக்கான விதிகளை யார் உருவாக்கினார்?

# faq_who_made_rules_a
source: The rules were made by grown-ups from different countries to protect all children.
si: විවිධ රටවල්වල වැඩිහිටියන්, ලෝකයේ සියලු දරුවන් සුරක්ෂිතව සිටින්නට මෙම නීති සකස් කළාය.
ta: விவித நாடுகளை சேர்ந்த பெரியவர்கள் இந்த விதிகளை உருவாக்கினார்கள்.

# faq_examples_q
source: What are some examples of child rights?
si: ළමා හිමිකම් වල උදාහරණ කිහිපයක් මොනවාද?
ta: குழந்தை உரிமைகளுக்கான சில உதாரணங்கள் என்ன?

# faq_examples_a
source: Some examples include the right to go to school, be safe, play, eat, and express your opinions.
si: උදාහරණ: පාසල් යාමට හිමිකම, ආරක්ෂාව, ක්‍රීඩා කිරීම, ආහාරය, සහ ඔබේ අදහස් කියාදීම.
ta: உதாரணமாக பள்ளி செல்லும் உரிமை, பாதுகாப்பு, விளையாட்டு, உணவு மற்றும் தங்கள் கருத்தை கூறும் உரிமை.

# faq_different_rights_q
source: Can children have different rights?
si: දරුවන්ට වෙනස් හිමිකම් තියෙනවද?
ta: குழந்தைகளுக்கு வேறு உரிமைகள் இருக்க முடியுமா?

# faq_different_rights_a
source: No matter where you live or what you look like, all children have the same basic rights.
si: ඔබ කොහෙ ජීවත් වෙන්නෙ හෝ ඔබේ රූපය කෙසේ වෙන්නෙ වුවද, සියලු දරුවන්ට සමාන මුලික හිමිකම් ඇත.
ta: இல்லை, உலகின் அனைத்து குழந்தைகளுக்கும் ஒரே உரிமைகள் உள்ளன.
